RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_DCM.h
#define DCM_DCMSTAT_DCMDBGPS_MASK                (0x400U)
#define DCM_DCMSTAT_DCMDBGPS_SHIFT               (10U)
#define DCM_DCMSTAT_DCMDBGPS_WIDTH               (1U)
#define DCM_DCMSTAT_DCMDBGPS(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSTAT_DCMDBGPS_SHIFT)) & DCM_DCMSTAT_DCMDBGPS_MASK)
/*! @} */

/*! @name DCMLCC - LC and LC Control */
/*! @{ */

#define DCM_DCMLCC_DCMCLC_MASK                   (0x7U)
#define DCM_DCMLCC_DCMCLC_SHIFT                  (0U)
#define DCM_DCMLCC_DCMCLC_WIDTH                  (3U)
#define DCM_DCMLCC_DCMCLC(x)                     (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCC_DCMCLC_SHIFT)) & DCM_DCMLCC_DCMCLC_MASK)

#define DCM_DCMLCC_DCMLCFN_MASK                  (0x8U)
#define DCM_DCMLCC_DCMLCFN_SHIFT                 (3U)
#define DCM_DCMLCC_DCMLCFN_WIDTH                 (1U)
#define DCM_DCMLCC_DCMLCFN(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCC_DCMLCFN_SHIFT)) & DCM_DCMLCC_DCMLCFN_MASK)

#define DCM_DCMLCC_DCMRLC_MASK                   (0x70U)
#define DCM_DCMLCC_DCMRLC_SHIFT                  (4U)
#define DCM_DCMLCC_DCMRLC_WIDTH                  (3U)
#define DCM_DCMLCC_DCMRLC(x)                     (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCC_DCMRLC_SHIFT)) & DCM_DCMLCC_DCMRLC_MASK)

#define DCM_DCMLCC_DCMFLC_MASK                   (0x300U)
#define DCM_DCMLCC_DCMFLC_SHIFT                  (8U)
#define DCM_DCMLCC_DCMFLC_WIDTH                  (2U)
#define DCM_DCMLCC_DCMFLC(x)                     (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCC_DCMFLC_SHIFT)) & DCM_DCMLCC_DCMFLC_MASK)
/*! @} */

/*! @name DCMLCS - LC Scan Status */
/*! @{ */

#define DCM_DCMLCS_DCMLCSS1_MASK                 (0x1U)
#define DCM_DCMLCS_DCMLCSS1_SHIFT                (0U)
#define DCM_DCMLCS_DCMLCSS1_WIDTH                (1U)
#define DCM_DCMLCS_DCMLCSS1(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCSS1_SHIFT)) & DCM_DCMLCS_DCMLCSS1_MASK)

#define DCM_DCMLCS_DCMLCC1_MASK                  (0xEU)
#define DCM_DCMLCS_DCMLCC1_SHIFT                 (1U)
#define DCM_DCMLCS_DCMLCC1_WIDTH                 (3U)
#define DCM_DCMLCS_DCMLCC1(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCC1_SHIFT)) & DCM_DCMLCS_DCMLCC1_MASK)

#define DCM_DCMLCS_DCMLCE1_MASK                  (0x10U)
#define DCM_DCMLCS_DCMLCE1_SHIFT                 (4U)
#define DCM_DCMLCS_DCMLCE1_WIDTH                 (1U)
#define DCM_DCMLCS_DCMLCE1(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCE1_SHIFT)) & DCM_DCMLCS_DCMLCE1_MASK)

#define DCM_DCMLCS_DCMLCFE1_MASK                 (0x20U)
#define DCM_DCMLCS_DCMLCFE1_SHIFT                (5U)
#define DCM_DCMLCS_DCMLCFE1_WIDTH                (1U)
#define DCM_DCMLCS_DCMLCFE1(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCFE1_SHIFT)) & DCM_DCMLCS_DCMLCFE1_MASK)

#define DCM_DCMLCS_DCMLCSS2_MASK                 (0x40U)
#define DCM_DCMLCS_DCMLCSS2_SHIFT                (6U)
#define DCM_DCMLCS_DCMLCSS2_WIDTH                (1U)
#define DCM_DCMLCS_DCMLCSS2(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCSS2_SHIFT)) & DCM_DCMLCS_DCMLCSS2_MASK)

#define DCM_DCMLCS_DCMLCC2_MASK                  (0x380U)
#define DCM_DCMLCS_DCMLCC2_SHIFT                 (7U)
#define DCM_DCMLCS_DCMLCC2_WIDTH                 (3U)
#define DCM_DCMLCS_DCMLCC2(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCC2_SHIFT)) & DCM_DCMLCS_DCMLCC2_MASK)

#define DCM_DCMLCS_DCMLCE2_MASK                  (0x400U)
#define DCM_DCMLCS_DCMLCE2_SHIFT                 (10U)
#define DCM_DCMLCS_DCMLCE2_WIDTH                 (1U)
#define DCM_DCMLCS_DCMLCE2(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCE2_SHIFT)) & DCM_DCMLCS_DCMLCE2_MASK)

#define DCM_DCMLCS_DCMLCFE2_MASK                 (0x800U)
#define DCM_DCMLCS_DCMLCFE2_SHIFT                (11U)
#define DCM_DCMLCS_DCMLCFE2_WIDTH                (1U)
#define DCM_DCMLCS_DCMLCFE2(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCFE2_SHIFT)) & DCM_DCMLCS_DCMLCFE2_MASK)

#define DCM_DCMLCS_DCMLCSS3_MASK                 (0x1000U)
#define DCM_DCMLCS_DCMLCSS3_SHIFT                (12U)
#define DCM_DCMLCS_DCMLCSS3_WIDTH                (1U)
#define DCM_DCMLCS_DCMLCSS3(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCSS3_SHIFT)) & DCM_DCMLCS_DCMLCSS3_MASK)

#define DCM_DCMLCS_DCMLCC3_MASK                  (0xE000U)
#define DCM_DCMLCS_DCMLCC3_SHIFT                 (13U)
#define DCM_DCMLCS_DCMLCC3_WIDTH                 (3U)
#define DCM_DCMLCS_DCMLCC3(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCC3_SHIFT)) & DCM_DCMLCS_DCMLCC3_MASK)

#define DCM_DCMLCS_DCMLCE3_MASK                  (0x10000U)
#define DCM_DCMLCS_DCMLCE3_SHIFT                 (16U)
#define DCM_DCMLCS_DCMLCE3_WIDTH                 (1U)
#define DCM_DCMLCS_DCMLCE3(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCE3_SHIFT)) & DCM_DCMLCS_DCMLCE3_MASK)

#define DCM_DCMLCS_DCMLCFE3_MASK                 (0x20000U)
#define DCM_DCMLCS_DCMLCFE3_SHIFT                (17U)
#define DCM_DCMLCS_DCMLCFE3_WIDTH                (1U)
#define DCM_DCMLCS_DCMLCFE3(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCFE3_SHIFT)) & DCM_DCMLCS_DCMLCFE3_MASK)

#define DCM_DCMLCS_DCMLCSS4_MASK                 (0x40000U)
#define DCM_DCMLCS_DCMLCSS4_SHIFT                (18U)
#define DCM_DCMLCS_DCMLCSS4_WIDTH                (1U)
#define DCM_DCMLCS_DCMLCSS4(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCSS4_SHIFT)) & DCM_DCMLCS_DCMLCSS4_MASK)

#define DCM_DCMLCS_DCMLCC4_MASK                  (0x380000U)
#define DCM_DCMLCS_DCMLCC4_SHIFT                 (19U)
#define DCM_DCMLCS_DCMLCC4_WIDTH                 (3U)
#define DCM_DCMLCS_DCMLCC4(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCC4_SHIFT)) & DCM_DCMLCS_DCMLCC4_MASK)

#define DCM_DCMLCS_DCMLCE4_MASK                  (0x400000U)
#define DCM_DCMLCS_DCMLCE4_SHIFT                 (22U)
#define DCM_DCMLCS_DCMLCE4_WIDTH                 (1U)
#define DCM_DCMLCS_DCMLCE4(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_DCMLCE4_SHIFT)) & DCM_DCMLCS_DCMLCE4_MASK)

