RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_DCM.h
#define DCM_DCMSRR_DCMESD2_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD2_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD2_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD2(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD2_SHIFT)) & DCM_DCMSRR_DCMESD2_MASK)

#define DCM_DCMSRR_DCMDCFT2_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT2_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT2_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT2(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT2_SHIFT)) & DCM_DCMSRR_DCMDCFT2_MASK)

#define DCM_DCMSRR_DCMDCFE3_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE3_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE3_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE3(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE3_SHIFT)) & DCM_DCMSRR_DCMDCFE3_MASK)

#define DCM_DCMSRR_DCMDCFF3_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF3_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF3_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF3(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF3_SHIFT)) & DCM_DCMSRR_DCMDCFF3_MASK)

#define DCM_DCMSRR_DCMESF3_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF3_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF3_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF3(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF3_SHIFT)) & DCM_DCMSRR_DCMESF3_MASK)

#define DCM_DCMSRR_DCMESD3_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD3_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD3_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD3(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD3_SHIFT)) & DCM_DCMSRR_DCMESD3_MASK)

#define DCM_DCMSRR_DCMDCFT3_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT3_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT3_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT3(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT3_SHIFT)) & DCM_DCMSRR_DCMDCFT3_MASK)

#define DCM_DCMSRR_DCMDCFE4_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE4_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE4_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE4(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE4_SHIFT)) & DCM_DCMSRR_DCMDCFE4_MASK)

#define DCM_DCMSRR_DCMDCFF4_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF4_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF4_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF4(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF4_SHIFT)) & DCM_DCMSRR_DCMDCFF4_MASK)

#define DCM_DCMSRR_DCMESF4_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF4_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF4_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF4(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF4_SHIFT)) & DCM_DCMSRR_DCMESF4_MASK)

#define DCM_DCMSRR_DCMESD4_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD4_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD4_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD4(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD4_SHIFT)) & DCM_DCMSRR_DCMESD4_MASK)

#define DCM_DCMSRR_DCMDCFT4_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT4_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT4_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT4(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT4_SHIFT)) & DCM_DCMSRR_DCMDCFT4_MASK)

#define DCM_DCMSRR_DCMDCFE5_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE5_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE5_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE5(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE5_SHIFT)) & DCM_DCMSRR_DCMDCFE5_MASK)

#define DCM_DCMSRR_DCMDCFF5_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF5_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF5_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF5(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF5_SHIFT)) & DCM_DCMSRR_DCMDCFF5_MASK)

#define DCM_DCMSRR_DCMESF5_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF5_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF5_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF5(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF5_SHIFT)) & DCM_DCMSRR_DCMESF5_MASK)

#define DCM_DCMSRR_DCMESD5_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD5_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD5_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD5(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD5_SHIFT)) & DCM_DCMSRR_DCMESD5_MASK)

#define DCM_DCMSRR_DCMDCFT5_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT5_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT5_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT5(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT5_SHIFT)) & DCM_DCMSRR_DCMDCFT5_MASK)

#define DCM_DCMSRR_DCMDCFE6_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE6_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE6_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE6(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE6_SHIFT)) & DCM_DCMSRR_DCMDCFE6_MASK)

#define DCM_DCMSRR_DCMDCFF6_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF6_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF6_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF6(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF6_SHIFT)) & DCM_DCMSRR_DCMDCFF6_MASK)

#define DCM_DCMSRR_DCMESF6_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF6_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF6_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF6(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF6_SHIFT)) & DCM_DCMSRR_DCMESF6_MASK)

#define DCM_DCMSRR_DCMESD6_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD6_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD6_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD6(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD6_SHIFT)) & DCM_DCMSRR_DCMESD6_MASK)

#define DCM_DCMSRR_DCMDCFT6_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT6_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT6_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT6(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT6_SHIFT)) & DCM_DCMSRR_DCMDCFT6_MASK)

#define DCM_DCMSRR_DCMDCFE7_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE7_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE7_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE7(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE7_SHIFT)) & DCM_DCMSRR_DCMDCFE7_MASK)

#define DCM_DCMSRR_DCMDCFF7_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF7_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF7_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF7(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF7_SHIFT)) & DCM_DCMSRR_DCMDCFF7_MASK)

#define DCM_DCMSRR_DCMESF7_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF7_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF7_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF7(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF7_SHIFT)) & DCM_DCMSRR_DCMESF7_MASK)

