RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_DCM.h
#define DCM_DCMSRR_DCMESD7_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD7_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD7_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD7(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD7_SHIFT)) & DCM_DCMSRR_DCMESD7_MASK)

#define DCM_DCMSRR_DCMDCFT7_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT7_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT7_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT7(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT7_SHIFT)) & DCM_DCMSRR_DCMDCFT7_MASK)

#define DCM_DCMSRR_DCMDCFE8_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE8_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE8_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE8(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE8_SHIFT)) & DCM_DCMSRR_DCMDCFE8_MASK)

#define DCM_DCMSRR_DCMDCFF8_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF8_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF8_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF8(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF8_SHIFT)) & DCM_DCMSRR_DCMDCFF8_MASK)

#define DCM_DCMSRR_DCMESF8_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF8_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF8_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF8(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF8_SHIFT)) & DCM_DCMSRR_DCMESF8_MASK)

#define DCM_DCMSRR_DCMESD8_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD8_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD8_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD8(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD8_SHIFT)) & DCM_DCMSRR_DCMESD8_MASK)

#define DCM_DCMSRR_DCMDCFT8_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT8_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT8_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT8(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT8_SHIFT)) & DCM_DCMSRR_DCMDCFT8_MASK)

#define DCM_DCMSRR_DCMDCFE9_MASK                 (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE9_SHIFT                (0U)
#define DCM_DCMSRR_DCMDCFE9_WIDTH                (21U)
#define DCM_DCMSRR_DCMDCFE9(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE9_SHIFT)) & DCM_DCMSRR_DCMDCFE9_MASK)

#define DCM_DCMSRR_DCMDCFF9_MASK                 (0x7000000U)
#define DCM_DCMSRR_DCMDCFF9_SHIFT                (24U)
#define DCM_DCMSRR_DCMDCFF9_WIDTH                (3U)
#define DCM_DCMSRR_DCMDCFF9(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF9_SHIFT)) & DCM_DCMSRR_DCMDCFF9_MASK)

#define DCM_DCMSRR_DCMESF9_MASK                  (0x8000000U)
#define DCM_DCMSRR_DCMESF9_SHIFT                 (27U)
#define DCM_DCMSRR_DCMESF9_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESF9(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF9_SHIFT)) & DCM_DCMSRR_DCMESF9_MASK)

#define DCM_DCMSRR_DCMESD9_MASK                  (0x10000000U)
#define DCM_DCMSRR_DCMESD9_SHIFT                 (28U)
#define DCM_DCMSRR_DCMESD9_WIDTH                 (1U)
#define DCM_DCMSRR_DCMESD9(x)                    (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD9_SHIFT)) & DCM_DCMSRR_DCMESD9_MASK)

#define DCM_DCMSRR_DCMDCFT9_MASK                 (0x20000000U)
#define DCM_DCMSRR_DCMDCFT9_SHIFT                (29U)
#define DCM_DCMSRR_DCMDCFT9_WIDTH                (1U)
#define DCM_DCMSRR_DCMDCFT9(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT9_SHIFT)) & DCM_DCMSRR_DCMDCFT9_MASK)

#define DCM_DCMSRR_DCMDCFE10_MASK                (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE10_SHIFT               (0U)
#define DCM_DCMSRR_DCMDCFE10_WIDTH               (21U)
#define DCM_DCMSRR_DCMDCFE10(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE10_SHIFT)) & DCM_DCMSRR_DCMDCFE10_MASK)

#define DCM_DCMSRR_DCMDCFF10_MASK                (0x7000000U)
#define DCM_DCMSRR_DCMDCFF10_SHIFT               (24U)
#define DCM_DCMSRR_DCMDCFF10_WIDTH               (3U)
#define DCM_DCMSRR_DCMDCFF10(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF10_SHIFT)) & DCM_DCMSRR_DCMDCFF10_MASK)

#define DCM_DCMSRR_DCMESF10_MASK                 (0x8000000U)
#define DCM_DCMSRR_DCMESF10_SHIFT                (27U)
#define DCM_DCMSRR_DCMESF10_WIDTH                (1U)
#define DCM_DCMSRR_DCMESF10(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF10_SHIFT)) & DCM_DCMSRR_DCMESF10_MASK)

#define DCM_DCMSRR_DCMESD10_MASK                 (0x10000000U)
#define DCM_DCMSRR_DCMESD10_SHIFT                (28U)
#define DCM_DCMSRR_DCMESD10_WIDTH                (1U)
#define DCM_DCMSRR_DCMESD10(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD10_SHIFT)) & DCM_DCMSRR_DCMESD10_MASK)

#define DCM_DCMSRR_DCMDCFT10_MASK                (0x20000000U)
#define DCM_DCMSRR_DCMDCFT10_SHIFT               (29U)
#define DCM_DCMSRR_DCMDCFT10_WIDTH               (1U)
#define DCM_DCMSRR_DCMDCFT10(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT10_SHIFT)) & DCM_DCMSRR_DCMDCFT10_MASK)

#define DCM_DCMSRR_DCMDCFE11_MASK                (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE11_SHIFT               (0U)
#define DCM_DCMSRR_DCMDCFE11_WIDTH               (21U)
#define DCM_DCMSRR_DCMDCFE11(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE11_SHIFT)) & DCM_DCMSRR_DCMDCFE11_MASK)

#define DCM_DCMSRR_DCMDCFF11_MASK                (0x7000000U)
#define DCM_DCMSRR_DCMDCFF11_SHIFT               (24U)
#define DCM_DCMSRR_DCMDCFF11_WIDTH               (3U)
#define DCM_DCMSRR_DCMDCFF11(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF11_SHIFT)) & DCM_DCMSRR_DCMDCFF11_MASK)

#define DCM_DCMSRR_DCMESF11_MASK                 (0x8000000U)
#define DCM_DCMSRR_DCMESF11_SHIFT                (27U)
#define DCM_DCMSRR_DCMESF11_WIDTH                (1U)
#define DCM_DCMSRR_DCMESF11(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF11_SHIFT)) & DCM_DCMSRR_DCMESF11_MASK)

#define DCM_DCMSRR_DCMESD11_MASK                 (0x10000000U)
#define DCM_DCMSRR_DCMESD11_SHIFT                (28U)
#define DCM_DCMSRR_DCMESD11_WIDTH                (1U)
#define DCM_DCMSRR_DCMESD11(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD11_SHIFT)) & DCM_DCMSRR_DCMESD11_MASK)

